/* ====================================================================== */
/* Auth Dialog */

/* ---------------------------------------------------------------------- */
/* Window Titles */
"ENTER_CREDENTIALS" = "Digitar Credenciais";
"CONNECT_TO_SERVER" = "Conectar ao Servidor";
"PRINTER_AUTH" = "Autenticação de Impressora";
"SCREEN_SHARE_AUTH" = "Compartilhar Tela";

/* ---------------------------------------------------------------------- */
/* Auth Dialog Messages */

/* Generic Connect */
"GENERIC_MSG_BOTH" = "Digite seu nome e senha para conectar-se a “%@”.";
"GENERIC_MSG_PASS" = "Digite sua senha para conectar-se a “%@”.";
"GENERIC_MSG_NONAME" = "Digite seu nome e senha.";

/* Protocol Specific */
"AFP_MSG" = "Digite seu nome e sua senha para o servidor “%@”.";
"SMB_MSG" = "Digite seu nome e sua senha para o servidor “%@”.";
"FTP_MSG" = "Digite seu nome e sua senha para o servidor “%@”.";
"WEBDAV_MSG" = "Digite seu nome e sua senha para o servidor “%@”.";

/* File Server */
"FS_MSG_BOTH" = "Digite seu nome e sua senha para o servidor “%@”.";
"FS_MSG_PASS" = "Digite sua senha para o servidor “%@”.";

/* Generic Server */
"SRV_MSG_BOTH" = "Digite seu nome e sua senha para o servidor “%@”.";
"SRV_MSG_PASS" = "Digite sua senha para o servidor “%@”.";

/* Printer */
"PRINT_MSG_BOTH" = "Digite seu nome e sua senha para a impressora “%@”.";
"PRINT_MSG_PASS" = "Digite sua senha para a impressora “%@”.";

/* Print Server */
"PS_MSG_BOTH" = "Digite seu nome de usuário e senha de acesso ao servidor de impressão “%@”.";
"PS_MSG_PASS" = "Digite seu nome de usuário e senha de acesso ao servidor de impressão “%@”.";

/* Screen Sharing */
"SS_MSG_BOTH" = "Digite seu nome de usuário e senha para compartilhar a tela de “%@”.";
"SS_MSG_PASS" = "Digite sua senha para compartilhar a tela de “%@”.";

"VS_MSG_BOTH" = "Digite seu nome de usuário e senha para visualizar a tela de “%@”.";
"VS_MSG_PASS" = "Digite a sua senha para visualizar a tela de “%@”.";

/* Time Machine */
"TM_MSG_BOTH" = "Digite seu nome e sua senha de acesso ao servidor “%@” para que o Time Machine possa acessá-lo.";
"TM_MSG_PASS" = "Digite a sua senha de acesso ao servidor “%@” para que o Time Machine possa acessá-lo.";

/* Pre Auth */
"PA_MSG_BOTH" = "Digite seu nome e sua senha para o servidor proxy “%@”.";
"PA_MSG_PASS" = "Digite sua senha para o servidor proxy “%@”.";


/* ---------------------------------------------------------------------- */
/* Auth Dialog Buttons */
"CONNECT" = "Conectar";
"SHARE" = "Compartilhar";
"PRINT" = "Imprimir";
"VIEW" = "Visualizar";
"OK" = "OK";

"CONNECT_AS" = "Conectar como:";
"GUEST" = "Convidado";
"REGISTERED_USER" = "Usuário Registrado";

"CONNECT_BY" = "Conectar:";
"BY_ASKING_FOR_PERMISSION" = "Pedindo permissão";
"AS_REGISTERED_USER" = "Como um usuário registrado";


/* ---------------------------------------------------------------------- */
/* Tool Tips */
"TOOLTIP_NAME_SMB" = "Domínio\\Nome de Usuário";

/* ====================================================================== */
/* Share Picker Messages */
"SELECT_VOLUME_ON_SERVER" = "Selecione os volumes que você deseja montar em “%@”:";
"SELECT_VOLUME" = "Selecionar os volumes para montar:";

"SELECT_PRINTER_ON_SERVER" = "Selecione a impressora em “%@”:";

/* ---------------------------------------------------------------------- */
/* default western encoding name */
"WESTERN_MAC" = "Ocidental (Mac)";


/* ====================================================================== */
/* Change Password */
"CHANGE_PASSWORD_MSG" = "Alterar a senha para “%1$@” em “%2$@”.";


/* ====================================================================== */
/* Progress Dialog */
"CONNECTING_TO_GENERIC" = "Conectando...";
"CONNECTING_TO_HOST" = "Conectando-se a “%@”.";


/* ====================================================================== */
/* Volume Password */
"ENTER_VOLUME_PASSWORD_FOR_SERVER" = "Digite a senha “%@”, no servidor de arquivos “%@”.";
"ENTER_VOLUME_PASSWORD" = "Digite a senha para “%@”.";


/* ====================================================================== */
/* Keychain Kinds */
"NETWORK_PASSWORD" = "senha da rede";
"PRINT_PASSWORD" = "Senha da Impressora";
"AFP_PASSWORD" = "Senha AFP";
"SMB_PASSWORD" = "Senha SMB";
"FTP_PASSWORD" = "Senha FTP";
"WEBDAV_PASSWORD" = "Senha WebDAV";
"VNC_PASSWORD" = "Senha VNC";


/* ====================================================================== */
/* ---------------------------------------------------------------------- */
/* Error Message Text */
"EMSG_OCCURRED" = "Ocorreu um erro.";
"EMSG_INVALID_PWD" = "Você digitou uma senha inválida.";
"EMSG_INVALID_NAME_PWD" = "Você digitou um nome de usuário ou uma senha inválidos.";
"EMSG_PWD_EXPIRED" = "A sua senha expirou.";
"EMSG_PWD_NEEDS_CHANGE" = "Sua senha precisa ser modificada.";
"EMSG_PWD_POLICY" = "Sua senha não cumpre com a política imposta pelo servidor.";
"EMSG_CONNECTION_FAILED" = "A conexão falhou";

"EMSG_MOUNT_FAILURE" = "Falha na montagem de um volume.";

/* ---------------------------------------------------------------------- */
/* Error Info Text */
"EINFO_TRY_AGAIN" = "Por favor, tente novamente.";
"EINFO_CONTACT_ADMIN" = "Entre em contato com o administrador do sistema para obter mais informações.";

"EINFO_NO_ACCESS_USER" = "Você não tem permissão para acessar o servidor “%@”.";
"EINFO_NO_ACCESS_GUEST" = "O servidor “%@” não permite acesso a convidados.";
"EINFO_SAME_MACHINE" = "O servidor “%@” está disponível no seu computador. Acesse os volumes e arquivos localmente.";
"EINFO_NO_SERVER" = "Talvez o servidor “%@” não exista ou não esteja disponível no momento. Confira o nome ou o endereço IP do servidor, verifique a conexão de rede e depois tente novamente.";
"EINFO_TOO_MANY_USERS" = "O servidor “%@” não permitirá o início de sessão de nenhum novo usuário. Tente conectar-se novamente mais tarde.";
"EINFO_GENERAL" = "Ocorreu um erro de conexão ao servidor “%@”. Confira o nome do servidor ou o endereço IP e depois tente novamente.\n\nSe você não conseguir resolver o problema, entre em contato com o administrador do sistema.";
"EINFO_NO_SHARES" = "Não há compartilhamentos disponíveis ou você não possui permissão para acessá-los no servidor “%@”. Entre em contato com o administrador do sistema para solucionar o problema.";

"EINFO_NO_ACCESS_USER_UNKNOWN" = "Você não tem permissão para acessar este servidor.";
"EINFO_NO_ACCESS_GUEST_UNKNOWN" = "Este servidor não permite acesso a convidados.";
"EINFO_SAME_MACHINE_UNKNOWN" = "Este servidor de arquivos está disponível no seu computador. Acesse os volumes e arquivos localmente.";
"EINFO_NO_SERVER_UNKNOWN" = "Talvez o servidor não exista ou não esteja disponível no momento. Confira o nome ou o endereço IP do servidor, verifique a conexão de rede e depois tente novamente.";
"EINFO_TOO_MANY_USERS_UNKNOWN" = "Este servidor de arquivos não permitirá o início de sessão de nenhum novo usuário. Tente conectar-se novamente mais tarde.";
"EINFO_GENERAL_UNKNOWN" = "Ocorreu um erro de conexão ao servidor. Confira o nome do servidor ou o endereço IP e depois tente novamente.\n\nSe você não conseguir resolver o problema, entre em contato com o administrador do sistema.";
"EINFO_NO_SHARES_UNKNOWN" = "Não há compartilhamentos disponíveis ou você não possui permissão para acessá-los no servidor. Entre em contato com o administrador do sistema para solucionar o problema.";

"EINFO_UNKNOWN_MOUNT_FAILED" = "Ocorreu um erro ao montar um volume.";
"EINFO_ONE_MOUNT_FAILED" = "O volume “%@” não pôde ser montado.";
"EINFO_MULTIPLE_MOUNTS_FAILED" = "Os seguintes volumes não puderam ser montados:";
